### **Exploratory Data Analysis** - En busca del éxito profesional

#### **Análisis de los factores clave que impulsan la empleabilidad de los estudiantes universitarios**

#### **DESCRIPCIÓN**

Este proyecto tiene como objetivo realizar un análisis exploratorio de datos para determinar aquellos factores fundamentales 
que influyen en la empleabilidad de los estudiantes universitarios. 
A través de la exploración detallada de un conjunto de datos que abarcan información sobre la educación familiar, 
habilidades lingüísticas, ramas de conocimiento, tipo de educación recibida, y otros aspectos relevantes, 
buscamos identificar patrones y relaciones que puedan determinar cuáles son las claves para el éxito laboral de los estudiantes. 
Este estudio proporcionará una comprensión profunda de los elementos que impulsan la empleabilidad, 
contribuyendo así a orientar estrategias educativas y de carrera para potenciar las oportunidades laborales de los estudiantes universitarios.

#### **HIPÓTESIS**

El objetivo principal es saber si factores como el tipo de universidad o la rama de conocimiento te garantizan más oportunidades laborales al terminar el grado universitario. 

Los **factores clave** a tener en cuenta en este análisis exploratorio para obtener conclusiones son:

- Rama de conocimiento

- Tipo de universidad

- Edad

- Motivación por los estudios



Las **hipótesis principales** planteadas se corresponde con cada factor anterior y son las siguientes:

1. Los estudiantes de ciertas ramas tiene más oportunidades de encontrar trabajo .

2. Estudiar en una universidad privada te garantiza más oportunidades de empleo al terminar el grado universitario.

3. La edad de obtención del título universitario influye en la empleabilidad.

4.  La vocación hacia los estudios afecta la empleabilidad de los estudiantes.

### **DATOS**

Los datos empleados en el análisis exploratorio se corresponden con una encuentra realizada por el Instituto Nacional de Estadística (INE) y se trata de una encuesta de Inserción Laboral de los Titulados Universitarios en 2019 (EILU). Esta encuesta se centra principalmente en la situación laboral de graduados universitarios en el curso escolar 2013/2014. Los datos contienen información de 31,651 titulados. 

La encuesta abarca información sobre el entorno demográfico y universitario, educación y aprendizaje, proceso de incorporación al empleo, adecuación de los estudios al empleo y movilidad geográfica. El hecho de que los datos se obtuvieran en 2019 proporciona una visión más estable de la situación laboral de los graduados en comparación con el momento inmediatamente posterior a la obtención del grado.

In [6]:
import numpy as numpy
import pandas as pd

df = pd.read_csv("../data/EILU_2019.csv",sep="\t")
cod = pd.read_excel("../data/dr_EILU_2019.xlsx",header=1,usecols = 'A:I')

C:\Users\beatr\AppData\Local\Temp\ipykernel_23360\289587214.py:4: DtypeWarning: Columns (119) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("../data/EILU_2019.csv",sep="\t")

In [7]:
df.head()

,IDENT,SEXO,EDAD,NACIO,NACIO1,NACIO2,PAIS_NACI,TITU,RAMA,AMBITO,...,ANHCUR4,DENCUR5,DURCUR5,RESCUR5,ANHCUR5,DENCUR6,DURCUR6,RESCUR6,ANHCUR6,FACTOR
0,1,1,1,1,,,1,11101,3,11,...,,,,,,,,,,9.894742
1,2,1,1,1,,,1,11101,3,11,...,,,,,,,,,,9.894742
2,3,1,1,1,,,1,11101,3,11,...,,,,,,,,,,10.965467
3,4,1,1,1,,,1,11101,3,11,...,,,,,,,,,,10.859689
4,5,1,1,1,,,1,11101,3,11,...,,,,,,,,,,10.859689

In [8]:
df.tail()

,IDENT,SEXO,EDAD,NACIO,NACIO1,NACIO2,PAIS_NACI,TITU,RAMA,AMBITO,...,ANHCUR4,DENCUR5,DURCUR5,RESCUR5,ANHCUR5,DENCUR6,DURCUR6,RESCUR6,ANHCUR6,FACTOR
31646,31647,2,2,1,,,1,109999,3,109,...,,,,,,,,,,1.780764
31647,31648,2,2,1,,,1,109999,3,109,...,,,,,,,,,,1.780764
31648,31649,1,3,1,,,1,109999,3,109,...,,,,,,,,,,3.038041
31649,31650,1,1,1,,,1,109999,3,109,...,,,,,,,,,,3.038041
31650,31651,1,3,1,,,1,109999,3,109,...,,,,,,,,,,2.311008

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31651 entries, 0 to 31650
Columns: 299 entries, IDENT to FACTOR
dtypes: float64(6), int64(56), object(237)
memory usage: 72.2+ MB

In [10]:
cod.head()

,Variable,Diccionario de la variable,Longitud,Tipo,Decimales,Posición,Orden,Diccionario ubicado en la hoja…,Descripción
0,IDENT,NaN,5,N,NaN,1.0,1.0,NaN,Nº de identificación de la persona
1,SEXO,TSEXO,1,A,NaN,6.0,2.0,Tablas1,Sexo
2,EDAD,TEDAD,1,A,NaN,7.0,3.0,Tablas1,Grupo de edad (a 31-dic-2019)
3,NACIO,TNACIO,1,A,NaN,8.0,4.0,Tablas1,Nacionalidad
4,NACIO1,TNACIOP,1,A,NaN,9.0,5.0,Tablas1,País de nacionalidad 1

In [11]:
cod.tail()

,Variable,Diccionario de la variable,Longitud,Tipo,Decimales,Posición,Orden,Diccionario ubicado en la hoja…,Descripción
295,DURCUR6,TDrCurs,1,A,NaN,371.0,296.0,Tablas2,Duración del sexto curso de formación del SEPE...
296,RESCUR6,TReCurs,1,A,NaN,372.0,297.0,Tablas2,Resultado del sexto curso de formación del SEP...
297,ANHCUR6,TAnCurs,4,A,NaN,373.0,298.0,Tablas2,Año de finalización del sexto curso de formaci...
298,FACTOR,NaN,11,N,6.0,377.0,299.0,NaN,Factor de elevación (seis decimales )
299,TOTAL,NaN,387,NaN,NaN,NaN,NaN,NaN,NaN

### **BIBLIOGRAFÍA**